--
-- Файл сгенерирован с помощью SQLiteStudio v3.3.3 в вт квіт. 27 08:19:45 2021
--
-- Использованная кодировка текста: UTF-8
--
PRAGMA foreign_keys = off;
BEGIN TRANSACTION;

-- Таблица: Endokrynka
CREATE TABLE Endokrynka (id INTEGER PRIMARY KEY AUTOINCREMENT, question TEXT, answer TEXT);
INSERT INTO Endokrynka (id, question, answer) VALUES (1, 'Діагностичні критерії акромегалії та гігантизму.', 'Гігантизм:
    1. В основі даного захворюваня лежить соматотропінома (пухлина передньої долі гіпофіза, що спричиняє гіперпродукцію соматотропного гормону)
    2. Зріст в чоловіків більше 2 метри, у жінок – більше 1,80 метри.
    3. Пропорційний ріст пацієнта (рівномірне лінійне розростання скелету і відповідно внутрішніх органів), адже пухлина виникає в той період, коли зони росту ще відкриті (тобто дитячий або підлітковий вік).
    4. Порушення вуглеводневого обміну (соматотропний гормон має контрінсулярну дію)
    5. МРТ – виявлення пухлини мозку (збільшення розміру турецького сідла більше 9*11)
    6. Визначення інсуліноподібного фактору росту. Можна ще визначити соматотропний гормон, проте він дуже нестійкий.

Акромегалія:
    1. В основі даного захворюваня лежить соматотропінома (пухлина передньої долі гіпофіза, що спричиняє гіперпродукцію соматотропного гормону)
    2. Диспропорційне розростання скелету за рахунок хрящової тканини (розростаються ніс, вуха, пацієнта може турбувати те, що збільшився розмір головного убору, взуття, обручки). Це відбувається внаслідок того, що зони росту вже закриті.
    3. Порушення вуглеводневого обміну
    4. МРТ – виявлення пухлини мозку (збільшення розміру турецького сідла більше 9*11)

    5. Визначення інсуліноподібного фактору росту. Можна ще визначити соматотропний гормон, проте він дуже нестійкий.');
INSERT INTO Endokrynka (id, question, answer) VALUES (2, '2. Діагностичні критерії нецукрового діабету', '    • В основі даного захворюваня лежить соматотропінома (пухлина передньої долі гіпофіза, що спричиняє гіперпродукцію соматотропного гормону)
    • Зріст в чоловіків більше 2 метри, у жінок – більше 1,80 метри.
    • Пропорційний ріст пацієнта (рівномірне лінійне розростання скелету і відповідно внутрішніх органів), адже пухлина виникає в той період, коли зони росту ще відкриті (тобто дитячий або підлітковий вік).
    • Порушення вуглеводневого обміну (соматотропний гормон має контрінсулярну дію)
    • МРТ – виявлення пухлини мозку (збільшення розміру турецького сідла більше 9*11)
    • Визначення інсуліноподібного фактору росту. Можна ще визначити соматотропний гормон, проте він дуже нестійкий.');
INSERT INTO Endokrynka (id, question, answer) VALUES (3, '3.Діагностичні критерії пангіпопітуітаризму.', '    • В основі даного захворюваня лежить соматотропінома (пухлина передньої долі гіпофіза, що спричиняє гіперпродукцію соматотропного гормону)
    • Зріст в чоловіків більше 2 метри, у жінок – більше 1,80 метри.
    • Пропорційний ріст пацієнта (рівномірне лінійне розростання скелету і відповідно внутрішніх органів), адже пухлина виникає в той період, коли зони росту ще відкриті (тобто дитячий або підлітковий вік).
    • Порушення вуглеводневого обміну (соматотропний гормон має контрінсулярну дію)
    • МРТ – виявлення пухлини мозку (збільшення розміру турецького сідла більше 9*11)
    • Визначення інсуліноподібного фактору росту. Можна ще визначити соматотропний гормон, проте він дуже нестійкий.');
INSERT INTO Endokrynka (id, question, answer) VALUES (4, '4. Діагностичні критерії хвороби та синдрому Іценко-Кушінга', '1. Синдроми
    1) Астеноадинамічний: ураження нервової та м’язової системи, що характеризується загальною слабкістю, Г оловний біль, запаморочення ,зниження пам''яті, слабкість, дратівливість, плаксивість, депресії 
    2) Гіпертензиний синдром: Стійка АГ з аідвищ Систолічного та діастолічного тиску
    3) Остеопоротичний синдром: біль у кістках, симптоми вторинного радикуліту на тлі сисемного остеопорозу з переважним ураженням хребців, ребер, кісток черепа, таза переломи.
    4) Синдром порушення жирового обміну: диспластичне ожиріння
    5) Синдром порушення статевої функції: порушення МЦ, безплідність, гірсутизм, галакторея – у жінок. Імпотенція, стерильність – у чоловіків.
    6) Синдром порушення вуглеводного обміну: поруш толерантності до глюкози.
    7) Синдром ураження шкіри: тонка, суха, ціанотична, на грудях та спині акне. Уділянках живота, плечей, стегон, грудей широкі багряно-ціанотичні смуги розтягу, гіперпігментація в місцях тертя
    8) - порушення толерантності до глюкози
- підвищення рівня кортизолу в крові;
- підвищення АКТГ;
- підвищена добова ексскреція кортизолу з сечею;
- позитивна мала і велика проба з дексаметазоном. 

Варіант 2
Для хвороби Іценко-Кушинга:
    • Зріст: уповільнений
    • Симптоми мускулінізації: не характерні
    • Велика проба з декаметазоном: позитивна
    • Мала проба з дексаметазоном: негативна
    • Тест толерантності до глюкози: порушена толерантність до глюкози, можливий ЦД
    • Кортизол у добовій сечі: підвищений
    • Рівень АКТГ: підвищений, рідко нормальний.
    • Рівень Na, Cl: підвищений
    • Рівень K: знижений
    • УЗД надниркових залоз: двостороннє збільшення НЗ
    • КТ (або МРТ): двостороннє збільшення НЗ
Для синдрому Іценко-Кушинга:
    • Зріст: уповільнений
    • Симптоми мускулінізації: часто
    • Велика проба з декаметазоном: негативна
    • Мала проба з дексаметазоном: негативна
    • Тест толерантності до глюкози: порушена толерантність до глюкози, можливий ЦД
    • Кортизол у добовій сечі: підвищений
    • Рівень АКТГ: знижений
    • Рівень Na, Cl: підвищений
    • Рівень K: знижений
    • УЗД надниркових залоз: одностороннє збільшення НЗ, візуалізується пухлина
    • КТ (або МРТ): визначається пухлина НЗ');
INSERT INTO Endokrynka (id, question, answer) VALUES (5, '5.Діагностичні критерії феохромоцитоми.', 'наявність гіпертонічних кризів із раптовим підвищенням насамперед систолічного АТ яке може досягати 300 мм.рт.ст (злоякісна гіпертензія) з тривалістю від декількох хвилин до декількох годин, погано піддається медикаментозній корекції
- тахікардія (до 180/хв), аритмія
- тремор, шум у вухах, занепокоєння або страх, можливий синдром Рейно, розширені зіниці, пітливість, біль в грудях або животі, нудота або блювота
 - гіперглікемія і глюкозурія
- підвищення концентрації метаболітів катехоламінів в плазмі  і у сечі (підвищення ванілінмигдалевої кислоти, метанефринів)
- підвищення вільних метанефритів у плазмі крові та добовій сечі  
- позитивні гістамінова і глюкагонова проби
- наявність пухлиноподібних утворень в одному або двох наднирниках');
INSERT INTO Endokrynka (id, question, answer) VALUES (6, '6. Діагностичні критерії хвороби Конна.', '- Скарги на: головний біль, біль в серці, зниження зору, виражену спрагу, поліурію.
- Серцево-судинний синдром: постійна артеріальна гіпертензія, яка веде до сильного головного болю, болю в серці, зниження зору, дистрофічні зміни в міокарді.
- Нервово-м’язовий синдром:міастенія, напади можуть тривати від кількох хвилин до кількох годин; парестезії, судоми м’язів, можливі м’язові паралічі. 
- Синдром калійпенічної нефропатії: виражена спрага поліурія, розвиток хронічного пієлонефриту.
Лабораторно-інструментальні:
    • Біохімічний аналіз крові: гіпернатріємія, гіпокаліємія,підвищення рівня альдостерону, зниження рівня реніну.
    • Підвищення  альдостерон-ренінового співвідношення
    • ЕКГ: брадикардія, аритмія, сповільнення А-V провідності
    • УЗД: аденома або гіперплазія наднирників.

Варіант 2

1) артеріальна гіпертензія (низькоренінова) - пов’язана із збільшенням вмісту натрію в крові і стінці кровоносних судин, внаслідок чого підвищується чутливість їх гладких м’язів до дії пресорних факторів, зокрема катехоламінів;
2) гіпокаліємія - результат посиленої секреції іонів К+ в канальцях нирок, що приводить до порушень діяльності збудливих органів і тканин (порушення роботи серця, скелетної мускулатури, парези);
3) негазовий алкалоз - пов’язаний із посиленням ацидогенезу в дисталь-них звивистих канальцях нефронів;
4) поліурія - виникає внаслідок втрати чутливості епітелію ниркових канальців до дії вазопресину. Цим  пояснюється той факт, що при первинному гіперальдостеронізмі об‘єм циркулюючої крові не зростає і набряки не розвиваються.

Плюс лаб фіг зна які
Діагностичні проби. Верошпірон по 100 мг 4 рази на день 3 дні. На 4-й день беруть кров на калій. Якщо його вміст збільшився — більше як на 1 ммоль/л, то можна думати про хворобу Конна. Гіпотіазид 100 мг дається після визначення калію в крові. Через 6 годин знову беруть кров і визначають вміст калію. Зменшення його рівня більше, як на 1 ммоль/л свідчить про гіперальдостеронізм. 
На УЗД, КТ, МРТ надниркових залоз: аденома або гіперплазія надниркових залоз. ');
INSERT INTO Endokrynka (id, question, answer) VALUES (7, '7.Діагностичні критерії цукрового діабету 1 типу.', '- гострий або раптовий початок з яскраво вираженою симптоматикою (спрага, сухість в роті, поліурія, поліфагія, полідипсія)
- схильність до кетозів, кетоацидозів (часто розпочинається з кетоацидотичної коми)
- характерна сезонність (загострення в осінньо-весняний період)
- молодий вік (зазвичай до 25-30 років)
- хворіють частіше чоловіки
- наявні випадки зазворювань в родині
- пацієнти відразу потребують лікування інсуліном, відсутній позитивний ефект від застосування цукрознижуючих препаратів
- з хронічних ускладнень переважають мікроангіопатії
- дефіцит маси тіла
- HbAc1 >7% 
- Глікемія натще > 6,1 ммоль/л 
- Випадкове визначення глюкози > 11,1ммоль/л 
- Глікемія  після ПГТТ> 11,1 ммоль/л 
- наявні АТ до острівців підшлункової залози та до декарбоксилпзи глютамінової кислоти
- Знижений або не виявляється С-пептид у крові
- Наявні антитіла до глутаматдекарбоксилази(GAB), тирозинфосфатази білків(ІА2), інсуліну, цитоплазматичних компонентів острівцевих клітин.');
INSERT INTO Endokrynka (id, question, answer) VALUES (8, '8. Діагностичні критерії цукрового діабету 2 типу.', 'Критерії діагностики ЦД типу 2 (за рекомендаціями ISPAD):
1. Клінічні 
- обтяжена спадковість по ЦД,  
- тривалий латентний перебіг.  
- індекс маси тіла (ІМТ) вище середніх показників від вікової норми,  
- відсутність схильності до кетонурії, 
2. Параклінічні 
а. Обов‘язкові лабораторні
- помірна гіперглікемія натще (до 10 ммоль/л),
- постпрандіальна гіперглікемія до 10 - 14 ммоль/л,
- можливі сліди глюкозурії,
б. Додаткові лабораторні
- рівень глікованого гемоглобіну на момент виявлення захворювання > 6.4%,
- Відсутність маркерів автоімунної реакції до ?-клітин підшлункової залози та глютаматдекарбоксилази (GAD)

Варіант 2
    • -  Виявляється у старшої вікової категорії 
    • -  характеризується тривалим безсимптомним перебігом 
    • -  клінічно проявляється полідипсією і поліурією 
    • -  наявне ожиріння 
    • -  на момент виявлення пацієнти мають захворювання серцево-судинної системи та різні ускладення ЦД такі як макроангіопатія, ретинопатія 
    • -  HbAc1 >7% 
    • -  Глікемія натще > 6,1 ммоль/л 
    • -  Випадкове визначення глюкози > 11,1ммоль/л 
    • -  Глікемія після ПГТТ> 11,1 ммоль/л 
    • -  Вміст інсуліну =або> (86-180ммоль/л) та С-пептиду=або> (0,9-4 нг/мл). 
- Відсутні антитіла до глутаматдекарбоксилази(GAB), тирозинфосфатази білків(ІА2), інсуліну, цитоплазматичних компонентів острівцевих клітин. 


Ст. 17 – синдроми, Пасєчко');
INSERT INTO Endokrynka (id, question, answer) VALUES (9, '9.Діагностичні критерії гіпоглікемічної коми.', '-гострий раптовий початок (декілька хвилин) 
- виникає внаслідок передозування інсуліну і таблетованих цукрознижуючих препаратів, інтенсивне фізичне навантаження, прийом алкоголю, несвоєчасний прийом їжі після інсуліну
- розвивається за рівня глюкози нижче 2,8 - 2,2 ммоль/л, хоча іноді можуть бути вищі показники глікемії
- тахікардія, мідріаз, тремтіння, блідість шкіри, пітливість, відчуття голоду, занепокоєння, агресивність 
- спочатку розвивається «поведінка п’яної людини», агресивність, потім пацієнт втрачає свідомість
- слабкість, парестезії, судоми, порушення поведінки, судоми
- підвищення сухожилкових рефлексів, ригідність м’язів
- за тривалої відсутності допомоги розвивається глибока кома, арефлексія, припинення потовиділення, гіпотензія, що може закінчитися смертю');
INSERT INTO Endokrynka (id, question, answer) VALUES (10, '10. Діагностичні критерії кетоацидотичної коми.', 'Синдроми
    1. Гіперглікемічний(глікемія до 30 ммоль/л, справга, сухість у роті, полідипсія, добова поліурія більше 3 літрів, поліфагія, сухість шкіри)
    2. Катаболічний синдром (втрата ваги, загальна слабкість)
    3. Інтоксикаційний синдром (нудота блювота, загальна слабкість)
    4. Ураження ССС ( порушення серцевого ритму і кровообігу) 
Клініка : 
- Спрага, полідипсія, поліурія (з подальшою олігурією і анурією)загальна та
м’язова слабкість, схуднення. Запах ацетону з ротової порожнини, можливі
нудота, блювота, апетит відсутній.
- При об’єктивному обстеженні: сухість шкіри і слизових оболонок, холодні на
дотик, знижений тургор шкіри, скелетних м’язів та очних яблук, можливий
рубеоз щік. Дихання рідке, шумне – Кусмауля. Тиск знижений або нормальний,
пульс частий, слабкого наповнення, можливі аритмії
- У 30-50% випадків - «абдомінальний синдром» з клінікою «гострого
живота» (біль в животі, часта блювота, болючість і напруження черевної
стінки, зменшення перистальтики).
- В анамнезі: недостатнє введення інсуліну, інфекції, ГСН, травми, тривале
голодування, вагітність.

ЗАК: лейкоцитоз
ЗАС: Глюкозурія; кетонурія; протеїнурія (непостійно), висока питома густина сечі.
БАК: Гіперглікемія; гіперкетонемія; підвищення азоту сечовини і креатиніну (непостійно).
Кислотно-лужний стан: Декомпенсований метаболічний ацидоз.');
INSERT INTO Endokrynka (id, question, answer) VALUES (11, '11.Діагностичні критерії первинного гіпотиреозу.', 'спостерігається при ураженні безпосередньо щитовидної залози
    • Розвивається поступово.
    • Скарги: на слабкість, втомлюваність, мерзлякуватість, сухість шкіри, випадіння волосся та зовнішньої третини брів
    •  Клінічно буде проявлятися: втомлюваністю, зниженням пам’яті, сонливістю, погіршенням сну, болем в м’язах, мерзлякуватістю, сухістю шкіри, вона груба, холодна, іноді з гіперкератозом (симптом брудних ліктів) випадінням волосся та зовнішньої третини брів, кровоточивістю ясен, руйнування зубів, погіршення апетиту, збільшення маси тіла, пастозністю, закрепами. 
    • Об’єктивно: одутловате обличчя жовтувато-блідого кольору, інколи, з рум’янцем на щоках, амімічне. очні щілини вузькі, блиск очей відсутній. Рот може бути відкритий, язик висунутий. 
    • Лаболаторно: підвищення рівня ТТГ і зниження Т4в та Т3в. 
    • Рентгенологічне дослідження кистей рук показує затримку “кісткового” віку. Порушення мінералізації скелету.');
INSERT INTO Endokrynka (id, question, answer) VALUES (12, '12. Діагностичуні критерії дифузного токсичного зобу..', 'Синдроми:
    1. Гіперфункції ЩЗ: Дифузно збільшена за рахунок обох часток і перешийка, безболісна, рухлива, еластичної консистенції. Аускультативно – над залозою систолічний шум. Зниження в крові ТТГ, збільшення Т4
    2. Ураження ССС: Тахікардія, посил верхівковий поштовх, акцентовані тони серця, екстрасистолія, пароксизмальна або постійна миготлива аритмія, систолічна АГ, збільшення пульсового тиску понад 60 мм рт ст, міокрддистрофія, СН.
    3. Синдром ураження шкіри та її придатків
    4. Ураження травної, нервової та м’язової системи (схильність до проносів, посилена перистальтика, дратівливість, емоційна лабільність, швидка стомлюваність, підвищена пітливість., м’язова слабість, атрофія, міастенія, періодичний параліч, проксимальна тиреотоксична міопатія)
    5. Катаболічний синдром (непереносимість спеки, втрата маси тіла, підвищений апетит, спрага)
    6. Ураження очей: офтальмопатія, очні симптоми Грефе, Мебіуса, Кохера, Штельвага, Крауса, Розенбага, Дельримпля.

Лабораторні критерії: лейкопенія, нейтропенія, лімфоцитоз, моноцитоз, тромбоцитопенія, підвищення ШОЕ, ознаки гіпохромної анемії; гіпохолестерінемія, гіпоальбумінемія, гіперглікемія; підвищений рівень Т3 і Т4, зниження ТТГ, підвищення рівня антитіл до рТТГ.
  Значне підвищення білково-зв''язаного йоду крові (більше 315-670 нмоль / л); основний обмін підвищений; при скануванні визначаються «гарячі» і «теплі» вузли в щитовидній залозі. УЗД – дифузне збільшення ЩЗ, можливе зниження ехогенності ЩЗ, при доплері – посилення кровоточу по всій ЩЗ. - У разі ендокринної офтальмопатії – ознаки порушення ретробульбарних
м’язів за даними УЗД, КТ, МРТ.');
INSERT INTO Endokrynka (id, question, answer) VALUES (13, '13.Формулювання клінічного діагнозу згідно класифікації цукрового діабету 1 типу.
', 'Цукровий діабет, тип 1, важка форма, стадія декомпенсації. Діабетична препроліферативна ретинопатія. Діабетична полінейропатія, вегето-сенсорна форма. Діабетична нефропатія IV ст. (стадія протеінурії). Вторинна ниркова артеріальна гіпертензія. СН І ст.  

Важкість ставиться на основі хронічних ускладнень ЦД.  Відповідно при легкій формі хронічних ускладнень не буде. При середній формі наявні непроліферативна ретинопатія, нефропатія ІІІ ступеня (стадія мікроальбумінурії), енцефалопатія, нейропатія, мікроангіопатія. При наявності макроускладнень – інфаркт, інсульт, діабетична стопа відразу ставиться важка форма. Також важка форма ставиться при препроліферативній, проліферативній ретинопатії, діабетичній нефропатії 4 – 5 ступеня. В даного пацієнта наявні діабетична препроліферативна ретинопатія та діабетична нефропатія 4 стадія (протеїнурії) – а це свідчить про важкий перебіг.

Для визначення стадії компенсації визначають глікемію натще, постпрандіальну глкемію, глікований гемоглобін, холестерин, тригліцериди, АТ, ІМТ. Основним показником є р-нь глікованого гемоглобіну (відповідно – до 7%стадія компенсації, від 7-8% -  стадія субкомпенсації, більше 8% -стадія декомпенсації).
В кінці діагнозу виставляються хронічні ускладнення ЦД та супутні захворювання');
INSERT INTO Endokrynka (id, question, answer) VALUES (14, '14. Формулювання клінічного діагнозу згідно класифікації цукрового діабету 2 типу.', 'Цукровий діабет типу 2, середньої важкості ( при присутності початкових стадій ускладнень)в стадії компенсації (глікований гемоглобін до 7,5). Діабетична непроліферативна ретинопатія. Діабетична дистальна поліневропатія сенсорна форма. 
 
    1. Тип діабету за перебігом: 1 тип, 2 тип.
    2. Ступінь тяжкості: легкий, середньої важкості, важкий
    3. Стан компенсації: компенсований, субкомпенсований, декомпенсований (за рівнем глікемії та глікозильованого гемоглобіну)
    4. Наявність ускладнень: мікроангіопатії, макроангіопатії, універсальна мікро, макроангіопатія, нейропатія.
    5. Ураження інших органів та систем
    6. Гострі ускладнення діабету');
INSERT INTO Endokrynka (id, question, answer) VALUES (15, NULL, NULL);
INSERT INTO Endokrynka (id, question, answer) VALUES (16, NULL, NULL);
INSERT INTO Endokrynka (id, question, answer) VALUES (17, NULL, NULL);
INSERT INTO Endokrynka (id, question, answer) VALUES (18, NULL, NULL);
INSERT INTO Endokrynka (id, question, answer) VALUES (19, NULL, NULL);
INSERT INTO Endokrynka (id, question, answer) VALUES (20, NULL, NULL);
INSERT INTO Endokrynka (id, question, answer) VALUES (21, NULL, NULL);

-- Таблица: users
CREATE TABLE users (id INTEGER PRIMARY KEY AUTOINCREMENT, user_id VARCHAR (255) NOT NULL, first_name STRING (255), last_name STRING (255), status BOOLEAN DEFAULT (TRUE) NOT NULL);
INSERT INTO users (id, user_id, first_name, last_name, status) VALUES (2, '328642991', NULL, NULL, 0);
INSERT INTO users (id, user_id, first_name, last_name, status) VALUES (3, '704103874', NULL, NULL, 0);
INSERT INTO users (id, user_id, first_name, last_name, status) VALUES (4, '439291379', NULL, NULL, 0);
INSERT INTO users (id, user_id, first_name, last_name, status) VALUES (5, '390111984', NULL, NULL, 0);
INSERT INTO users (id, user_id, first_name, last_name, status) VALUES (6, '594010887', NULL, NULL, 1);
INSERT INTO users (id, user_id, first_name, last_name, status) VALUES (7, '612677065', NULL, NULL, 1);
INSERT INTO users (id, user_id, first_name, last_name, status) VALUES (8, '526846731', NULL, NULL, 1);
INSERT INTO users (id, user_id, first_name, last_name, status) VALUES (9, '336323433', NULL, NULL, 0);
INSERT INTO users (id, user_id, first_name, last_name, status) VALUES (10, '587695901', NULL, NULL, 0);
INSERT INTO users (id, user_id, first_name, last_name, status) VALUES (11, '507615493', 'Andrii', 'Tykhonov (0027)', 1);

COMMIT TRANSACTION;
PRAGMA foreign_keys = on;
